In [0]:
import pandas as pd
import numpy as np
import matplotlib.pylab as plt
%matplotlib inline
from datetime import datetime
import math

In [0]:
df = pd.read_csv('Dataforforcast.csv')
#del df['Unnamed: 6']
df['Year'] = df['Year'].astype(str).str.strip()
df.head()

   Year  Population  Dwellings  Employed  Unemployed  Train
0  2001        4940       2515      1727         112     74
1  2006        4952       2541      2183         126    113
2  2011        5309       2747      2360         138    138
3  2016        5769       3072      2478         145    184

In [0]:
a = []
for i in range(len(df['Year'])):
    a.append('31-12-'+df['Year'][i])

In [0]:
df['date'] = pd.DataFrame(a)
df['date'] = pd.to_datetime(df['date'])

In [0]:
data = df.drop(['date'], axis=1)
data.index = df.date

In [0]:
del data['Year']
train = data[:int(0.8*(len(data)))]
valid = data[int(0.2*(len(data))):]

In [0]:
valid

            Population  Dwellings  Employed  Unemployed  Train
date
2001-12-31        4940       2515      1727         112     74
2006-12-31        4952       2541      2183         126    113
2011-12-31        5309       2747      2360         138    138
2016-12-31        5769       3072      2478         145    184

In [0]:
from statsmodels.tsa.vector_ar.var_model import VAR

In [0]:
model = VAR(endog=train)
model_fit = model.fit()

/usr/local/lib/python3.6/dist-packages/statsmodels/tsa/base/tsa_model.py:165: ValueWarning: No frequency information was provided, so inferred frequency 5A-DEC will be used.
  % freq, ValueWarning)

In [0]:
prediction = model_fit.forecast(model_fit.y, steps=len(valid))

/usr/local/lib/python3.6/dist-packages/statsmodels/base/wrapper.py:35: FutureWarning: y is a deprecated alias for endog, will be removed in version 0.11.0
  obj = getattr(results, attr)

In [0]:
prediction

array([[5714.61636407, 2957.72570259, 2541.03932137,  148.65213339,
         149.17162742],
       [6152.07528792, 3184.17378422, 2735.5852772 ,  160.03562103,
         160.61416901],
       [6623.05373008, 3427.94265074, 2945.01182589,  172.2874622 ,
         172.9110176 ],
       [7130.08957738, 3690.37296874, 3170.4707874 ,  185.47714177,
         186.14846096]])

In [0]:
#df2 = [(2021, "2021-12-31 00:00:00"), (2026, "2026-12-31 00:00:00"), (2031, "2031-12-31 00:00:00"), (2036, "2036-12-31 00:00:00")]
#for i in range (len(prediction)):
#  l = []
#  l = prediction[i].tolist()
  #l.insert()
  #print(df2[i])
#  l.insert(0, df2[i][0])
  # print(l)
#  l.insert(6, df2[i][1])
#  print(l)
#  df = df.append(l, ignore_index = False)
# df
#print(l)

In [0]:
df = df.append({"Year" : 2021, "Population" : 5714, "Dwellings" : 2957, "Employed" : 2541, "Unemployed" : 148, "Train" : 149, "date" : "2021-12-31"}, ignore_index = True)
df

   Year  Population  Dwellings  ...  Unemployed  Train                 date
0  2001        4940       2515  ...         112     74  2001-12-31 00:00:00
1  2006        4952       2541  ...         126    113  2006-12-31 00:00:00
2  2011        5309       2747  ...         138    138  2011-12-31 00:00:00
3  2016        5769       3072  ...         145    184  2016-12-31 00:00:00
4  2021        5714       2957  ...         148    149           2021-12-31

[5 rows x 7 columns]

In [0]:
df = df.append({"Year" : 2026, "Population" : 6152, "Dwellings" : 3184, "Employed" : 2735, "Unemployed" : 160, "Train" : 160, "date" : "2026-12-31"}, ignore_index = True)
df

   Year  Population  Dwellings  ...  Unemployed  Train                 date
0  2001        4940       2515  ...         112     74  2001-12-31 00:00:00
1  2006        4952       2541  ...         126    113  2006-12-31 00:00:00
2  2011        5309       2747  ...         138    138  2011-12-31 00:00:00
3  2016        5769       3072  ...         145    184  2016-12-31 00:00:00
4  2021        5714       2957  ...         148    149           2021-12-31
5  2026        6152       3184  ...         160    160           2026-12-31

[6 rows x 7 columns]

In [0]:
df = df.append({"Year" : 2031, "Population" : 6623, "Dwellings" : 3427, "Employed" : 2945, "Unemployed" : 172, "Train" : 172, "date" : "2031-12-31"}, ignore_index = True)
df

   Year  Population  Dwellings  ...  Unemployed  Train                 date
0  2001        4940       2515  ...         112     74  2001-12-31 00:00:00
1  2006        4952       2541  ...         126    113  2006-12-31 00:00:00
2  2011        5309       2747  ...         138    138  2011-12-31 00:00:00
3  2016        5769       3072  ...         145    184  2016-12-31 00:00:00
4  2021        5714       2957  ...         148    149           2021-12-31
5  2026        6152       3184  ...         160    160           2026-12-31
6  2031        6623       3427  ...         172    172           2031-12-31

[7 rows x 7 columns]

In [0]:
df.drop(["date"], axis = 1)

   Year  Population  Dwellings  Employed  Unemployed  Train
0  2001        4940       2515      1727         112     74
1  2006        4952       2541      2183         126    113
2  2011        5309       2747      2360         138    138
3  2016        5769       3072      2478         145    184
4  2021        5714       2957      2541         148    149
5  2026        6152       3184      2735         160    160
6  2031        6623       3427      2945         172    172